Ran Plan for project: `terraform-minio` dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.bucket_policies["policy_cnpg_cnpg"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::cnpg/*",
            ]
        }
    }

  # module.bucket_policies["policy_cnpg_cnpg"].minio_iam_policy.main will be updated in-place
! resource "minio_iam_policy" "main" {
        id     = "cnpg-cnpg"
        name   = "cnpg-cnpg"
!       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::cnpg/*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.bucket_policies["policy_crowlexpro_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/crowlexpro/*",
            ]
        }
    }

  # module.bucket_policies["policy_crowlexpro_backup"].minio_iam_policy.main will be updated in-place
! resource "minio_iam_policy" "main" {
        id     = "crowlexpro-backup"
        name   = "crowlexpro-backup"
!       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::backup/crowlexpro/*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.bucket_policies["policy_jazzlyn_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/jazzlyn/*",
            ]
        }
    }

  # module.bucket_policies["policy_jazzlyn_backup"].minio_iam_policy.main will be updated in-place
! resource "minio_iam_policy" "main" {
        id     = "jazzlyn-backup"
        name   = "jazzlyn-backup"
!       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::backup/jazzlyn/*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.bucket_policies["policy_loki_loki"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::loki/*",
            ]
        }
    }

  # module.bucket_policies["policy_loki_loki"].minio_iam_policy.main will be updated in-place
! resource "minio_iam_policy" "main" {
        id     = "loki-loki"
        name   = "loki-loki"
!       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::loki/*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.bucket_policies["policy_techinik_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/techinik/*",
            ]
        }
    }

  # module.bucket_policies["policy_techinik_backup"].minio_iam_policy.main will be updated in-place
! resource "minio_iam_policy" "main" {
        id     = "techinik-backup"
        name   = "techinik-backup"
!       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::backup/techinik/*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.bucket_policies["policy_terraform_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform_terraform"].minio_iam_policy.main will be updated in-place
! resource "minio_iam_policy" "main" {
        id     = "terraform-terraform"
        name   = "terraform-terraform"
!       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::terraform/*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.bucket_policies["policy_thanos_thanos"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::thanos/*",
            ]
        }
    }

  # module.bucket_policies["policy_thanos_thanos"].minio_iam_policy.main will be updated in-place
! resource "minio_iam_policy" "main" {
        id     = "thanos-thanos"
        name   = "thanos-thanos"
!       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::thanos/*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.bucket_policies["policy_tyriis_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/tyriis/*",
            ]
        }
    }

  # module.bucket_policies["policy_tyriis_backup"].minio_iam_policy.main will be updated in-place
! resource "minio_iam_policy" "main" {
        id     = "tyriis-backup"
        name   = "tyriis-backup"
!       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::backup/tyriis/*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.bucket_policies["policy_volsync_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync_volsync"].minio_iam_policy.main will be updated in-place
! resource "minio_iam_policy" "main" {
        id     = "volsync-volsync"
        name   = "volsync-volsync"
!       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::volsync/*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.buckets["test"].minio_s3_bucket.main will be created
+ resource "minio_s3_bucket" "main" {
+       acl                = "private"
+       arn                = (known after apply)
+       bucket             = "test"
+       bucket_domain_name = (known after apply)
+       force_destroy      = false
+       id                 = (known after apply)
+       object_locking     = false
    }

Plan: 1 to add, 9 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p terraform-minio
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-techtales-io-terraform-minio.techtales.io/lock?id=techtales-io%252Fterraform-minio%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p terraform-minio
  ```
Plan: 1 to add, 9 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```